import React from 'react'
import ReactDOM from 'react-dom'
import Timer from './components/Countdown/Timer'
import Divider from '@material-ui/core/Divider';

import './styles.css'
import Container from './components/common/Container'
import Headline from './components/HeadLine/Headline'
import Numbers from './components/Numbers/Numbers'
import Story from './components/Story/Story'
import Work from './components/work/Work'
import Team from './components/team/Team'

function App() {
  const about = [
    {
      'id': 1,
      'vision': 'МУ-ын Дижитал шийдлийг дэлхийд танилцуулах  ',
      'mission': 'МТ-ийн салбарын судалгаа, зөвлөх үйлчилгээг мэргэжлийн түвшинд хүргэх ',
      'about': 'МУ-ын дижитал шилжилтийг хурдасгах, дотоодын дижитал шийдэл, нийлүүлэгч компаниудыг дэлхийд танилцуулах зорилготой "Дийг Ай Ти" ХХК нь 2021 оны 4 сард байгуулагдсан. ДИЖИТ нь Дижитал бүтээгдэхүүн, үйлчилгээний зах, тэргүүлэх технологийн судалгааны Дижит платформ юм. ',
      'slogan': 'Дижитал шийдэл, үйлчилгээний зах Дижит платформ. ',
      'strategy': 'Дижитал боловсрол, ур чадварыг хэрэглэгчдэд түгээх  ',
      'editor': '• МУ-ын хууль дүрэм журамд захирагдан Оюуны өмч, хүний эрхийн зохицуулалтын дагуу үйл ажиллагаагаа явуулна. \n• ОУ-ын дижитал шийдлийг платформд оруулах боловч МУ-н МТ-ийн компаниудыг дэмжих бодлого түлхүү баримтална. \n• Мэдээлэл, Зөвлөгөө, Контент бэлтгэхдээ үнэн зөв, ёс зүйтэй, нийлүүлэгчийн нэр хүндэд онцгойлон халдахгүйгээр нийтлэлийг бэлтгэнэ хүргэнэ. \n• Өрсөлдөгч рүү хандсан хэт сөрөг сэтгэгдэл, үндэслэлгүй буруу үнэлгээг платформ руу оруулахгүй, үл ойлголцол, доромжлолоос сэргийлнэ. \n• Хэрэглэгчийн хувийн мэдээллийг зөвшөөрөлгүйгээр ашиглахгүй. ',
      'platform': '• Систем, Програм, Платформ, Мобайл аппуудын мэдээллийг хэрэглэгчдэд цаг алдалгүй хүргэх, нэг дороос сонголт хийхэд туслах\n• Бизнесийн байгууллага, МТ-ийн компаниудын хооронд гүүр болж ажиллах\n• Хэрэглэгчийн сайжруулах саналыг авч чанартай бүтээгдэхүүн гаргахад туслах\n• Хэрэглэгчийн дижитал ур чадварыг нэмэгдүүлэх мэдлэг, зөвлөгөөг хүргэх\n• Хөрөнгө оруулагч, ОУ-ын байгууллагыг МТ-ийн салбарын судалгаагаар хангах\n• Гадаад, дотоодын чадварлаг инженерүүдийн мэдлэгийг бусдад түгээх\n• Гарааны компаниудад дижитал шийдлээ сурталчлахад туслах.',
      'contact': 'Хан-Уул дүүрэг 3-р хороо Хонгор аппартмент 305 тоот',
      'aboutplatform': 'МУ-ийн Дижитал бүтээгдэхүүн, үйлчилгээний зах, хэрэглэгчдийн дуу хоолой, технологийн зөвлөгөө, судалгааг хүргэх Дижилт платформд тавтай морилно уу! ',
      'phone': '99055488, 86686028',
      'mail': 'otgonbayar@digit.mn',
      'userrerms': 'Дижит платформ нь дижитал бүтээгдэхүүн, үйлчилгээ, нийлүүлэгчийн талаарх мэдээллийг хайх, бусадтай хуваалцах, зөвлөмж өгөх зэрэг контент үүсгэх боломжийг танд олгоно. Мөн програм хангамжийн нийлүүлэгчтэй холбогдож демо үзэх, хамтарч ажиллах хүсэлтийг илгээж болно. Та дижитал шийдэл, үйлчилгээг сайжруулдаг Дижит платформд бүртгүүлснээр дараах нөхцөлүүдийг дагаж мөрдөхөө хүлээн зөвшөөрч байгааг үүгээр илэрхийлж байна. Хэрэв та эдгээр бүх нөхцөлийг хүлээн зөвшөөрөхгүй бол Дижит платформыг ашиглах боломжгүй. Тиймээс нөхцлүүдийг анхааралтай уншина уу.  \n\n- Платформ нь зөвхөн 18-аас дээш насны хэрэглэгчдэд зориулагдсан . Та зөвхөн өөрийн зураг, мэдээллийг ашиглах бөгөөд өөр хүний дүрд хувирч мэдээлэл оруулахыг хориглоно. \n- Үнэлгээ өгөхдөө хэт муулсан эсвэл хэт магтсан нэг талыг барьсан агуулгыг нийтлэхгүй бөгөөд албан тушаал, ажлын газрын мэдээллийг нууцлах боломжгүй.\n- Энэ сайтын агуулга, мэдээлэл(үүнд өгөгдөл, мэдээлэл, текст, зураг, график, видео, лого, програм хангамж, код болон бусад материал орно) нь Дийг Ай Ти компанийн өмч болно. Платформ дээрх мэдээллийг олон нийтийн сүлжээнд бусадтай хуваалцахыг зөвшөөрөх боловч бусдад худалдах, арилжааны зорилгоор ашиглахыг хориглоно.\n- Та Монгол улсын хууль дүрэм журамд захирагдан Оюуны өмч, хүний эрхийн зохицуулалтын дагуу үйлдэл гаргана. \n- Мэдээлэл, зөвлөгөө, үнэлгээ өгөхдөө үнэн зөв, ёс зүйтэй, нийлүүлэгчийн нэр хүндэд онцгойлон халдахгүйгээр мэдээллийг бэлтгэнэ. \n- Та програм хангамжийн вирус эсвэл бусад хортой код агуулсан мэдээллийг нийтлэхгүй байх ёстой. ',
      'published_at': '2021-10-21T07:26:03.000Z',
      'created_at': '2021-10-16T00:36:11.000Z',
      'updated_at': '2021-12-16T10:23:24.000Z',
      'cover': [{
        'id': 3310,
        '_id': null,
        'name': '242156633_649695046407375_3544299606577741989_n (2).png',
        'alternativeText': '',
        'caption': '',
        'width': 1920,
        'height': 798,
        'formats': {
          'thumbnail': {
            'name': 'thumbnail_242156633_649695046407375_3544299606577741989_n (2).png',
            'hash': 'thumbnail_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019',
            'ext': '.png',
            'mime': 'image/png',
            'width': 245,
            'height': 102,
            'size': 49.5,
            'path': null,
            'url': '/uploads/thumbnail_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019.png'
          },
          'large': {
            'name': 'large_242156633_649695046407375_3544299606577741989_n (2).png',
            'hash': 'large_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019',
            'ext': '.png',
            'mime': 'image/png',
            'width': 1000,
            'height': 416,
            'size': 507.67,
            'path': null,
            'url': '/uploads/large_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019.png'
          },
          'medium': {
            'name': 'medium_242156633_649695046407375_3544299606577741989_n (2).png',
            'hash': 'medium_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019',
            'ext': '.png',
            'mime': 'image/png',
            'width': 750,
            'height': 312,
            'size': 309.6,
            'path': null,
            'url': '/uploads/medium_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019.png'
          },
          'small': {
            'name': 'small_242156633_649695046407375_3544299606577741989_n (2).png',
            'hash': 'small_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019',
            'ext': '.png',
            'mime': 'image/png',
            'width': 500,
            'height': 208,
            'size': 156.92,
            'path': null,
            'url': '/uploads/small_242156633_649695046407375_3544299606577741989_n_2_aa28fb4019.png'
          }
        },
        'hash': '242156633_649695046407375_3544299606577741989_n_2_aa28fb4019',
        'ext': '.png',
        'mime': 'image/png',
        'size': 677.7,
        'url': '/uploads/242156633_649695046407375_3544299606577741989_n_2_aa28fb4019.png',
        'previewUrl': null,
        'provider': 'local',
        'provider_metadata': null,
        'created_at': '2021-12-16T05:06:43.000Z',
        'updated_at': '2021-12-16T05:06:43.000Z'
      }],
      'homecover': {
        'id': 3309,
        '_id': null,
        'name': '263932860_3081312345439665_6228206176784483084_n.png',
        'alternativeText': '',
        'caption': '',
        'width': 2048,
        'height': 984,
        'formats': {
          'thumbnail': {
            'name': 'thumbnail_263932860_3081312345439665_6228206176784483084_n.png',
            'hash': 'thumbnail_263932860_3081312345439665_6228206176784483084_n_209aab74fd',
            'ext': '.png',
            'mime': 'image/png',
            'width': 245,
            'height': 118,
            'size': 29.6,
            'path': null,
            'url': '/uploads/thumbnail_263932860_3081312345439665_6228206176784483084_n_209aab74fd.png'
          },
          'large': {
            'name': 'large_263932860_3081312345439665_6228206176784483084_n.png',
            'hash': 'large_263932860_3081312345439665_6228206176784483084_n_209aab74fd',
            'ext': '.png',
            'mime': 'image/png',
            'width': 1000,
            'height': 480,
            'size': 287.94,
            'path': null,
            'url': '/uploads/large_263932860_3081312345439665_6228206176784483084_n_209aab74fd.png'
          },
          'medium': {
            'name': 'medium_263932860_3081312345439665_6228206176784483084_n.png',
            'hash': 'medium_263932860_3081312345439665_6228206176784483084_n_209aab74fd',
            'ext': '.png',
            'mime': 'image/png',
            'width': 750,
            'height': 360,
            'size': 184.7,
            'path': null,
            'url': '/uploads/medium_263932860_3081312345439665_6228206176784483084_n_209aab74fd.png'
          },
          'small': {
            'name': 'small_263932860_3081312345439665_6228206176784483084_n.png',
            'hash': 'small_263932860_3081312345439665_6228206176784483084_n_209aab74fd',
            'ext': '.png',
            'mime': 'image/png',
            'width': 500,
            'height': 240,
            'size': 96.81,
            'path': null,
            'url': '/uploads/small_263932860_3081312345439665_6228206176784483084_n_209aab74fd.png'
          }
        },
        'hash': '263932860_3081312345439665_6228206176784483084_n_209aab74fd',
        'ext': '.png',
        'mime': 'image/png',
        'size': 811.86,
        'url': '/uploads/263932860_3081312345439665_6228206176784483084_n_209aab74fd.png',
        'previewUrl': null,
        'provider': 'local',
        'provider_metadata': null,
        'created_at': '2021-12-16T03:51:23.000Z',
        'updated_at': '2021-12-16T03:51:23.000Z'
      }
    }]

  return (
    <div className="App">
      <div className="container">
        <Timer/>
        <Container bgcolor={'#fff'} position="relative">
          <Headline items={about}/>
          <Numbers/>
        </Container>
        <Container bgcolor={'#fff'} paddingY={'0 !important'}>
          <Story items={about}/>
          <Container bgcolor={'#fff'}>
            <Divider/>
          </Container>
        </Container>
        {/* <Container bgcolor={'#fff'}>
          <Features />
      </Container> */}
        <Container bgcolor={'#fff'}>
          <Work items={about}/>
        </Container>
        <Container>
          <Team items={about}/>
        </Container>
      </div>
    </div>
  )
}

const rootElement = document.getElementById('root')
ReactDOM.render(<App/>, rootElement)
